ArakniD/simplelink_msp432p4_sdk/examples/syscfg_preview/rtos/MSP_EXP432P4111/drivers/adcsinglechannel/adcsinglechannel.syscfg
/*
 * Copyright (c) 2018, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  adcsinglechannel.syscfg
 */

/* ======== RTOS ======== */
var RTOS = scripting.addModule("/ti/drivers/RTOS");

/* ======== Board ======== */
board = system.deviceData.board.name;

/* ======== ADC ======== */
var ADC = scripting.addModule("/ti/drivers/ADC");
var adc0 = ADC.addInstance();
var adc1 = ADC.addInstance();
adc0.$name = "Board_ADC0";
adc1.$name = "Board_ADC1";

if (board.match(/MSP.EXP432P/)) {
    adc0.adc.adcPin.$assign = "P5.5";
    adc1.adc.adcPin.$assign = "P5.4";
} else if (board.match(/MSP.EXP432E/)) {
    adc0.adc.adcPin.$assign = "PE3";
    adc1.adc.adcPin.$assign = "PE2";
} else if (board.match(/CC32..S/)) {
    adc0.adc.adcPin.$assign = "P59";
    adc1.adc.adcPin.$assign = "P60";
} else if (board.match(/CC[12][36]/)) {
    adc0.adc.adcPin.$assign = "DIO23";
    adc1.adc.adcPin.$assign = "DIO24";
}

/* ======== Display ======== */
var Display = scripting.addModule("/ti/display/Display");
var display = Display.addInstance();
display.$hardware = system.deviceData.board.components.xds110Uart;
